import coverBadrany from '@/public/coverBadrany.svg';
import coverBadrany2 from '@/public/coverBadrany2.svg';
import coverAslam from '@/public/coverAslam.svg';
import badrany1 from '@/public/badrany1.svg';
import badrany2 from '@/public/badrany2.svg'
import badrany3 from '@/public/badrany3.svg'
import badrany4 from '@/public/badrany4.svg'
import Member1 from "@/public/member1.svg";
import Member2 from "@/public/member2.svg";
import Member3 from "@/public/member3.svg";
import Member4 from "@/public/member4.svg";

const Members = [
  {
    id: 0,
    Image: Member1,
    name: "سعــــــــد عادل",
    type: "مدير الحساب",
  },
  {
    id: 1,
    Image: Member2,
    name: "مـــــــهاب إمام",
    type: "إدارة الأربـــاح",
  },
  {
    id: 2,
    Image: Member3,
    name: "محمـــد الصـــاوي ",
    type: "مدير خدمة العملاء",
  },
  {
    id: 3,
    Image: Member3,
    name: "محمـــد الصـــاوي",
    type: "مدير خدمة العملاء",
  },
  {
    id: 4,
    Image: Member4,
    name: "فتحـــــــــــي الصـــاوي",
    type: "المدير التنفيذي",
  },
];


const data = {
  saudi: {
    name: "المملكة العربية السعودية",
    projects: [
      {
        id: 0,
        name: "البدراني 1",
        cover: coverBadrany,
        images: [
          badrany1,
          badrany2,
          badrany3,
          badrany4,
        ],
        description1:
          "أستمتع بإقامة فاخرة، مناسبة تمامًا للاسترخاء في حي مذينب.",
        description2:
          "حيث تتميز وحداتنا الرائعة بتصميم جمالي حديث، مما يخلق أجواء أنيقة وعصرية التي تساعدك علي الاسترخاء في غرف النوم الفسيحة التي تتميز بأسرّة فخمة وجذابة للاستمتاع بنوم مريح حقًا أثناء الليل.",
        features: [],
        description3:
          "قم بإعداد المأكولات اللذيذة في المطبخ المجهز بالكامل.\nابق على اتصال: نضمن لك شبكة Wi-Fi عالية السرعة إمكانية البقاء على اتصال مع أحبائك أو بث برامجك المفضلة أثناء فترة توقفك عن العمل.\nيوفر ملاذ المذينب هذا مزيجًا مثاليًا من الأناقة والراحة والعملية.",
      },
      {
        id: 1,
        name: "البدراني 2",
        cover: coverBadrany2,
        images: [
          badrany1,
          badrany2,
          badrany3,
          badrany4,
        ],
        description1:
          "أستمتع بإقامة فاخرة، مناسبة تمامًا للاسترخاء في حي مذينب.",
        description2:
          "حيث تتميز وحداتنا الرائعة بتصميم جمالي حديث، مما يخلق أجواء أنيقة وعصرية التي تساعدك علي الاسترخاء في غرف النوم الفسيحة التي تتميز بأسرّة فخمة وجذابة للاستمتاع بنوم مريح حقًا أثناء الليل.",
        features: [],
        description3:
          "قم بإعداد المأكولات اللذيذة في المطبخ المجهز بالكامل.\nابق على اتصال: نضمن لك شبكة Wi-Fi عالية السرعة إمكانية البقاء على اتصال مع أحبائك أو بث برامجك المفضلة أثناء فترة توقفك عن العمل.\nيوفر ملاذ المذينب هذا مزيجًا مثاليًا من الأناقة والراحة والعملية.",
      },
      {
        id: 2,
        name: "السلام 1",
        cover: coverAslam,
        images: [
          badrany1,
          badrany2,
          badrany3,
          badrany4,
        ],
        description1:
          "أستمتع بإقامة فاخرة، مناسبة تمامًا للاسترخاء في حي مذينب.",
        description2:
          "حيث تتميز وحداتنا الرائعة بتصميم جمالي حديث، مما يخلق أجواء أنيقة وعصرية التي تساعدك علي الاسترخاء في غرف النوم الفسيحة التي تتميز بأسرّة فخمة وجذابة للاستمتاع بنوم مريح حقًا أثناء الليل.",
        features: [
          '1',
          '2',
          '3',
          '4',
        ],
        description3:
          "قم بإعداد المأكولات اللذيذة في المطبخ المجهز بالكامل.\nابق على اتصال: نضمن لك شبكة Wi-Fi عالية السرعة إمكانية البقاء على اتصال مع أحبائك أو بث برامجك المفضلة أثناء فترة توقفك عن العمل.\nيوفر ملاذ المذينب هذا مزيجًا مثاليًا من الأناقة والراحة والعملية.",
      },
    ],
  },
  misr: {
    name: "مصر",
    projects: [
      {
        id: 0,
        name: "البدراني 1",
        cover: coverBadrany,
        images: [
          badrany1,
          badrany2,
          badrany3,
          badrany4,
        ],
        description1:
          "أستمتع بإقامة فاخرة، مناسبة تمامًا للاسترخاء في حي مذينب.",
        description2:
          "حيث تتميز وحداتنا الرائعة بتصميم جمالي حديث، مما يخلق أجواء أنيقة وعصرية التي تساعدك علي الاسترخاء في غرف النوم الفسيحة التي تتميز بأسرّة فخمة وجذابة للاستمتاع بنوم مريح حقًا أثناء الليل.",
        features: [],
        description3:
          "قم بإعداد المأكولات اللذيذة في المطبخ المجهز بالكامل.\nابق على اتصال: نضمن لك شبكة Wi-Fi عالية السرعة إمكانية البقاء على اتصال مع أحبائك أو بث برامجك المفضلة أثناء فترة توقفك عن العمل.\nيوفر ملاذ المذينب هذا مزيجًا مثاليًا من الأناقة والراحة والعملية.",
      },
      {
        id: 1,
        name: "البدراني 2",
        cover: coverBadrany2,
        images: [
          badrany1,
          badrany2,
          badrany3,
          badrany4,
        ],
        description1:
          "أستمتع بإقامة فاخرة، مناسبة تمامًا للاسترخاء في حي مذينب.",
        description2:
          "حيث تتميز وحداتنا الرائعة بتصميم جمالي حديث، مما يخلق أجواء أنيقة وعصرية التي تساعدك علي الاسترخاء في غرف النوم الفسيحة التي تتميز بأسرّة فخمة وجذابة للاستمتاع بنوم مريح حقًا أثناء الليل.",
        features: [],
        description3:
          "قم بإعداد المأكولات اللذيذة في المطبخ المجهز بالكامل.\nابق على اتصال: نضمن لك شبكة Wi-Fi عالية السرعة إمكانية البقاء على اتصال مع أحبائك أو بث برامجك المفضلة أثناء فترة توقفك عن العمل.\nيوفر ملاذ المذينب هذا مزيجًا مثاليًا من الأناقة والراحة والعملية.",
      },
      {
        id: 2,
        name: "السلام 1",
        cover: coverAslam,
        images: [
          badrany1,
          badrany2,
          badrany3,
          badrany4,
        ],
        description1:
          "أستمتع بإقامة فاخرة، مناسبة تمامًا للاسترخاء في حي مذينب.",
        description2:
          "حيث تتميز وحداتنا الرائعة بتصميم جمالي حديث، مما يخلق أجواء أنيقة وعصرية التي تساعدك علي الاسترخاء في غرف النوم الفسيحة التي تتميز بأسرّة فخمة وجذابة للاستمتاع بنوم مريح حقًا أثناء الليل.",
        features: [],
        description3:
          "قم بإعداد المأكولات اللذيذة في المطبخ المجهز بالكامل.\nابق على اتصال: نضمن لك شبكة Wi-Fi عالية السرعة إمكانية البقاء على اتصال مع أحبائك أو بث برامجك المفضلة أثناء فترة توقفك عن العمل.\nيوفر ملاذ المذينب هذا مزيجًا مثاليًا من الأناقة والراحة والعملية.",
      },
    ],
  },
  england: {
    name: "بريطانيا",
    projects: [
      {
        id: 0,
        name: "البدراني 1",
        cover: coverBadrany,
        images: [
          badrany1,
          badrany2,
          badrany3,
          badrany4,
        ],
        description1:
          "أستمتع بإقامة فاخرة، مناسبة تمامًا للاسترخاء في حي مذينب.",
        description2:
          "حيث تتميز وحداتنا الرائعة بتصميم جمالي حديث، مما يخلق أجواء أنيقة وعصرية التي تساعدك علي الاسترخاء في غرف النوم الفسيحة التي تتميز بأسرّة فخمة وجذابة للاستمتاع بنوم مريح حقًا أثناء الليل.",
        features: [],
        description3:
          "قم بإعداد المأكولات اللذيذة في المطبخ المجهز بالكامل.\nابق على اتصال: نضمن لك شبكة Wi-Fi عالية السرعة إمكانية البقاء على اتصال مع أحبائك أو بث برامجك المفضلة أثناء فترة توقفك عن العمل.\nيوفر ملاذ المذينب هذا مزيجًا مثاليًا من الأناقة والراحة والعملية.",
      },
      {
        id: 1,
        name: "البدراني 2",
        cover: coverBadrany2,
        images: [
          badrany1,
          badrany2,
          badrany3,
          badrany4,
        ],
        description1:
          "أستمتع بإقامة فاخرة، مناسبة تمامًا للاسترخاء في حي مذينب.",
        description2:
          "حيث تتميز وحداتنا الرائعة بتصميم جمالي حديث، مما يخلق أجواء أنيقة وعصرية التي تساعدك علي الاسترخاء في غرف النوم الفسيحة التي تتميز بأسرّة فخمة وجذابة للاستمتاع بنوم مريح حقًا أثناء الليل.",
        features: [],
        description3:
          "قم بإعداد المأكولات اللذيذة في المطبخ المجهز بالكامل.\nابق على اتصال: نضمن لك شبكة Wi-Fi عالية السرعة إمكانية البقاء على اتصال مع أحبائك أو بث برامجك المفضلة أثناء فترة توقفك عن العمل.\nيوفر ملاذ المذينب هذا مزيجًا مثاليًا من الأناقة والراحة والعملية.",
      },
      {
        id: 2,
        name: "السلام 1",
        cover: coverAslam,
        images: [
          badrany1,
          badrany2,
          badrany3,
          badrany4,
        ],
        description1:
          "أستمتع بإقامة فاخرة، مناسبة تمامًا للاسترخاء في حي مذينب.",
        description2:
          "حيث تتميز وحداتنا الرائعة بتصميم جمالي حديث، مما يخلق أجواء أنيقة وعصرية التي تساعدك علي الاسترخاء في غرف النوم الفسيحة التي تتميز بأسرّة فخمة وجذابة للاستمتاع بنوم مريح حقًا أثناء الليل.",
        features: [],
        description3:
          "قم بإعداد المأكولات اللذيذة في المطبخ المجهز بالكامل.\nابق على اتصال: نضمن لك شبكة Wi-Fi عالية السرعة إمكانية البقاء على اتصال مع أحبائك أو بث برامجك المفضلة أثناء فترة توقفك عن العمل.\nيوفر ملاذ المذينب هذا مزيجًا مثاليًا من الأناقة والراحة والعملية.",
      },
    ],
  },
};

export { data, Members };
